lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/HardwareSerial.cpp
    const uint64_t source_hz = (F_CPU >= 128000000UL) ? 128000000ULL : 64000000ULL;
    uint64_t scaled =
        ((static_cast<uint64_t>(baud) << 32U) + (source_hz / 2ULL)) / source_hz;
    scaled = (scaled + 0x800ULL) & ~0xFFFULL;
    if (scaled > 0x10000000ULL) {
        scaled = 0x10000000ULL;
    }
    return static_cast<uint32_t>(scaled);
}

struct UarteFormat {
    uint32_t configReg;
    uint8_t dataMask;
};

static UarteFormat decode_serial_format(uint16_t config) {
    UarteFormat fmt{};
    // Preserve a valid baseline. On nRF54, CONFIG also contains FRAMESIZE and
    // other fields; leaving FRAMESIZE at 0 produces undefined behavior.
    fmt.configReg = (UARTE_CONFIG_HWFC_Disabled << UARTE_CONFIG_HWFC_Pos) |
                    (UARTE_CONFIG_FRAMESIZE_8bit << UARTE_CONFIG_FRAMESIZE_Pos);
    fmt.dataMask = 0xFFU;

    const uint8_t dataBits = static_cast<uint8_t>(5U + ((config >> 1U) & 0x3U));
    if (dataBits < 8U) {
        fmt.dataMask = static_cast<uint8_t>((1U << dataBits) - 1U);
    }
    const uint32_t frameSize = (dataBits == 5U) ? UARTE_CONFIG_FRAMESIZE_5bit
                              : (dataBits == 6U) ? UARTE_CONFIG_FRAMESIZE_6bit
                              : (dataBits == 7U) ? UARTE_CONFIG_FRAMESIZE_7bit
                                                : UARTE_CONFIG_FRAMESIZE_8bit;
    fmt.configReg &= ~UARTE_CONFIG_FRAMESIZE_Msk;
    fmt.configReg |= (frameSize << UARTE_CONFIG_FRAMESIZE_Pos);

    const uint8_t paritySel = static_cast<uint8_t>(config & 0x30U);
    if (paritySel == 0x20U || paritySel == 0x30U) {
        fmt.configReg |= (UARTE_CONFIG_PARITY_Included << UARTE_CONFIG_PARITY_Pos);
        fmt.configReg |= ((paritySel == 0x30U ? UARTE_CONFIG_PARITYTYPE_Odd
                                              : UARTE_CONFIG_PARITYTYPE_Even)
                          << UARTE_CONFIG_PARITYTYPE_Pos);
    } else {
        fmt.configReg |= (UARTE_CONFIG_PARITY_Excluded << UARTE_CONFIG_PARITY_Pos);
    }

    fmt.configReg |= (((config & 0x08U) != 0U ? UARTE_CONFIG_STOP_Two
                                               : UARTE_CONFIG_STOP_One)
                      << UARTE_CONFIG_STOP_Pos);

    return fmt;
}

static bool wait_event_timeout_us(uintptr_t base, uint32_t event_off, uint32_t timeout_us) {
    const unsigned long start = micros();
    while ((unsigned long)(micros() - start) < timeout_us) {
        if (reg32(base + event_off) != 0U) {
            return true;
        }
    }
    return reg32(base + event_off) != 0U;
}

static uint32_t serial_byte_timeout_us(unsigned long baud, uint32_t bytes) {
    if (baud == 0UL) {
        baud = 9600UL;
    }
    if (bytes == 0U) {
        bytes = 1U;
    }
    // 12 bits/byte includes start/data/parity/stop margin.
    const uint32_t per_byte = static_cast<uint32_t>((12000000ULL + baud - 1ULL) / baud);
    // Keep this small: Serial.available()/read() should not block for milliseconds.
    // Long blocking delays will starve the cooperative BLE stack and cause 0x08
    // supervision timeouts under load.
    // Tuned compromise: keep polling responsive while giving RX enough dwell time
    // to catch the first byte of a burst when called periodically.
    const uint32_t margin = 500UL;
    return (per_byte * bytes) + margin;
}

static constexpr uint32_t kUarteRxInterruptMask =
    UARTE_INTENCLR_ERROR_Msk |
    UARTE_INTENCLR_RXTO_Msk |
    UARTE_INTENCLR_FRAMETIMEOUT_Msk |
    UARTE_INTENCLR_DMARXEND_Msk |
    UARTE_INTENCLR_DMARXREADY_Msk;
static constexpr uint32_t kUarteTxInterruptMask =
    UARTE_INTENCLR_TXSTOPPED_Msk |
    UARTE_INTENCLR_DMATXBUSERROR_Msk;
static volatile uint16_t g_sharedConstlatUsers = 0U;

extern "C" uint8_t nrf54l15_constlat_acquire(void) {
    const uint32_t primask = __get_PRIMASK();
    __disable_irq();
    if (g_sharedConstlatUsers == UINT16_MAX) {
        __set_PRIMASK(primask);
        return 0U;
    }
    if (g_sharedConstlatUsers == 0U) {
        NRF_POWER->TASKS_CONSTLAT = POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger;
        __DSB();
        __ISB();
    }
    ++g_sharedConstlatUsers;
    __set_PRIMASK(primask);
    return 1U;
}

extern "C" void nrf54l15_constlat_release(void) {
    const uint32_t primask = __get_PRIMASK();
    __disable_irq();
    if (g_sharedConstlatUsers > 0U) {
        --g_sharedConstlatUsers;
        if (g_sharedConstlatUsers == 0U) {
            NRF_POWER->TASKS_LOWPWR = POWER_TASKS_LOWPWR_TASKS_LOWPWR_Trigger;
            __DSB();
            __ISB();
        }
    }
    __set_PRIMASK(primask);
}

extern "C" void nrf54l15_wire_handle_shared_irq(const NRF_TWIM_Type* twim);

static bool uart_try_irqn_for_instance(const NRF_UARTE_Type* uart, IRQn_Type* irqn) {
    if (irqn == nullptr || uart == nullptr) {
        return false;
    }

    const uintptr_t base = reinterpret_cast<uintptr_t>(uart);
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE00)) {
        *irqn = SPIM00_IRQn;
        return true;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE20)) {
        *irqn = SPIM20_IRQn;
        return true;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE21)) {
        *irqn = SPIM21_IRQn;
        return true;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE22)) {
        *irqn = SPIM22_IRQn;
        return true;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE30)) {
        *irqn = SPIM30_IRQn;
        return true;
    }
    return false;
}

static bool uart_route_valid(const NRF_UARTE_Type* uart,
                             uint8_t txPort, uint8_t tx,
                             uint8_t rxPort, uint8_t rx) {
    if (uart == nullptr || txPort != rxPort) {
        return false;
    }
    const uintptr_t base = reinterpret_cast<uintptr_t>(uart);
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE30)) {
        return txPort == 0U;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE00)) {
        return txPort == 2U &&
               ((tx == 2U && rx == 0U) || (tx == 8U && rx == 7U));
    }
    if (txPort == 1U) {
        return true;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE20)) {
        return txPort == 2U && tx == 2U && rx == 0U;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE21)) {
        return txPort == 2U && tx == 8U && rx == 7U;
    }
    return false;
}

static HardwareSerial* g_uarte00Owner = nullptr;
static HardwareSerial* g_uarte20Owner = nullptr;
static HardwareSerial* g_uarte21Owner = nullptr;
static HardwareSerial* g_uarte22Owner = nullptr;
static HardwareSerial* g_uarte30Owner = nullptr;
static HardwareSerial* g_unknownOwner = nullptr;

static HardwareSerial*& uart_owner_slot(const NRF_UARTE_Type* uart) {
    const uintptr_t base = reinterpret_cast<uintptr_t>(uart);
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE00)) {
        return g_uarte00Owner;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE20)) {
        return g_uarte20Owner;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE21)) {
        return g_uarte21Owner;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE22)) {
        return g_uarte22Owner;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE30)) {
        return g_uarte30Owner;
    }
    return g_unknownOwner;
}

}  // namespace

extern "C" void SPIM00_IRQHandler(void) {
    if (g_uarte00Owner != nullptr) {
        g_uarte00Owner->handleIrq();
    }
}

extern "C" void SPIM20_IRQHandler(void) {
    if (g_uarte20Owner != nullptr) {
        g_uarte20Owner->handleIrq();
    }
    nrf54l15_wire_handle_shared_irq(NRF_TWIM20);
}

extern "C" void SPIM21_IRQHandler(void) {
    if (g_uarte21Owner != nullptr) {
        g_uarte21Owner->handleIrq();
    }
    nrf54l15_wire_handle_shared_irq(NRF_TWIM21);
}

extern "C" void SPIM22_IRQHandler(void) {
    if (g_uarte22Owner != nullptr) {
        g_uarte22Owner->handleIrq();
    }
    nrf54l15_wire_handle_shared_irq(NRF_TWIM22);
}

extern "C" void SPIM30_IRQHandler(void) {
    if (g_uarte30Owner != nullptr) {
        g_uarte30Owner->handleIrq();
    }
    nrf54l15_wire_handle_shared_irq(NRF_TWIM30);
}

HardwareSerial::HardwareSerial(NRF_UARTE_Type* uart, uint8_t txPin, uint8_t rxPin)
    : _uart(uart),
      _txPin(txPin),
      _rxPin(rxPin),
      _configured(false),
      _constlatOwned(false),
      _lastShutdownClean(true),
      _baud(9600UL),
      _config(0U),
      _rxHead(0U),
      _rxTail(0U),
      _rxCount(0U),
      _rxDropped(0U),
      _rxDmaBuffer{{0U}, {0U}},
      _rxDmaActive(0U),
      _rxDmaPrepared(1U),
      _rxDmaRunning(false),
      _rxDmaObservedAmount(0U),
      _rxDmaLastActivityUs(0U),
      _txHead(0U),
      _txTail(0U),
      _txCount(0U),
      _txDmaCount(0U),
      _txDmaRunning(false),
      _txBuffer{0},
      _dataMask(0xFFU),
      _txRing{0},
      _rxRing{0} {}

