lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/HardwareSerial.cpp
void HardwareSerial::commitRxBytes(const uint8_t* data, uint32_t amount) {
    if (data == nullptr || amount == 0U) {
        return;
    }
    if (amount > kRxDmaChunkSize) {
        amount = kRxDmaChunkSize;
    }

    for (uint32_t i = 0; i < amount; ++i) {
        const uint8_t value = data[i];
        if (_rxCount >= kRxRingSize) {
            ++_rxDropped;
        } else {
            _rxRing[_rxHead] = value;
            _rxHead = static_cast<uint16_t>(
                (_rxHead + 1U) & static_cast<uint16_t>(kRxRingSize - 1U));
            ++_rxCount;
        }
    }
}

void HardwareSerial::begin(unsigned long baud) {
    begin(baud, SERIAL_8N1);
}

void HardwareSerial::begin(unsigned long baud, uint16_t config) {
    if (_uart == nullptr) {
        return;
    }
    if (_configured) {
        end();
    }

    uint8_t txPort = 0, tx = 0, rxPort = 0, rx = 0;
    if (!decode_pin(_txPin, &txPort, &tx) || !decode_pin(_rxPin, &rxPort, &rx) ||
        !uart_route_valid(_uart, txPort, tx, rxPort, rx)) {
        return;
    }

    release_nfc_pads_for_gpio(txPort, tx, rxPort, rx);
    configure_pin_output(txPort, tx, true);
    configure_pin_input(rxPort, rx, true);
    requestConstlatIfNeeded();

    const uintptr_t base = reinterpret_cast<uintptr_t>(_uart);

    reg32(base + U_ENABLE) = UARTE_ENABLE_ENABLE_Disabled;
    reg32(base + U_PSEL_TXD) = make_psel(txPort, tx);
    reg32(base + U_PSEL_RXD) = make_psel(rxPort, rx);
    reg32(base + U_PSEL_CTS) = kPselDisconnected;
    reg32(base + U_PSEL_RTS) = kPselDisconnected;
    const UarteFormat fmt = decode_serial_format(config);
    _dataMask = fmt.dataMask;
    reg32(base + U_CONFIG) = fmt.configReg |
                             (UARTE_CONFIG_FRAMETIMEOUT_Enabled << UARTE_CONFIG_FRAMETIMEOUT_Pos);
    reg32(base + U_BAUDRATE) = baud_to_reg(_uart, baud);
    reg32(base + U_ADDRESS) = 0U;
    reg32(base + U_FRAMETIMEOUT) = kRxFrameTimeoutBits;
    reg32(base + U_SHORTS) |= UARTE_SHORTS_DMA_TX_END_DMA_TX_STOP_Msk;
    reg32(base + U_ENABLE) = UARTE_ENABLE_ENABLE_Enabled;

    _baud = baud;
    _config = config;
    _rxHead = 0U;
    _rxTail = 0U;
    _rxCount = 0U;
    _rxDropped = 0U;
    _rxDmaActive = 0U;
    _rxDmaPrepared = 1U;
    _rxDmaRunning = false;
    _rxDmaObservedAmount = 0U;
    _rxDmaLastActivityUs = 0U;
    _txHead = 0U;
    _txTail = 0U;
    _txCount = 0U;
    _txDmaCount = 0U;
    _txDmaRunning = false;
    _configured = true;

    IRQn_Type irqn = Reset_IRQn;
    if (uart_try_irqn_for_instance(_uart, &irqn)) {
        HardwareSerial*& owner = uart_owner_slot(_uart);
        owner = this;
        NVIC_DisableIRQ(irqn);
        NVIC_ClearPendingIRQ(irqn);
        NVIC_SetPriority(irqn, 2U);
        NVIC_EnableIRQ(irqn);
    }
    reg32(base + U_EVENTS_DMA_TX_READY) = 0U;
    reg32(base + U_EVENTS_DMA_TX_END) = 0U;
    reg32(base + U_EVENTS_DMA_TX_BUSERROR) = 0U;
    reg32(base + U_EVENTS_TXSTOPPED) = 0U;
    reg32(base + U_DMA_TX_PTR) =
        static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&_txBuffer[0]));
    reg32(base + U_DMA_TX_MAXCNT) = 0U;
    reg32(base + U_TASKS_DMA_TX_START) = UARTE_TASKS_DMA_TX_START_START_Trigger;
    wait_event_timeout_us(base, U_EVENTS_TXSTOPPED, 2000UL);
    reg32(base + U_EVENTS_DMA_TX_READY) = 0U;
    reg32(base + U_EVENTS_TXSTOPPED) = 0U;
    reg32(base + U_INTENCLR) = kUarteTxInterruptMask;
    reg32(base + U_INTENSET) = kUarteTxInterruptMask;
    startRxDma();
}

void HardwareSerial::end() {
    if (_uart == nullptr) {
        _lastShutdownClean = true;
        return;
    }
    const bool txDrained = drainTxForShutdown();
    const bool rxStopped = stopRxDma();

    const uintptr_t base = reinterpret_cast<uintptr_t>(_uart);
    reg32(base + U_INTENCLR) = kUarteRxInterruptMask | kUarteTxInterruptMask;
    reg32(base + U_SHORTS) &= ~UARTE_SHORTS_DMA_TX_END_DMA_TX_STOP_Msk;
    reg32(base + U_EVENTS_TXSTOPPED) = 0U;
    reg32(base + U_TASKS_DMA_TX_STOP) = UARTE_TASKS_DMA_TX_STOP_STOP_Trigger;
    const bool txStopped = wait_event_timeout_us(
        base, U_EVENTS_TXSTOPPED, serial_byte_timeout_us(_baud, _txDmaCount + 1U));
    _lastShutdownClean = txDrained && rxStopped && txStopped;
    reg32(base + U_ENABLE) = UARTE_ENABLE_ENABLE_Disabled;

    reg32(base + U_PSEL_TXD) = kPselDisconnected;
    reg32(base + U_PSEL_RXD) = kPselDisconnected;
    reg32(base + U_PSEL_CTS) = kPselDisconnected;
    reg32(base + U_PSEL_RTS) = kPselDisconnected;

    IRQn_Type irqn = Reset_IRQn;
    if (uart_try_irqn_for_instance(_uart, &irqn)) {
        HardwareSerial*& owner = uart_owner_slot(_uart);
        if (owner == this) {
            NVIC_DisableIRQ(irqn);
            NVIC_ClearPendingIRQ(irqn);
            owner = nullptr;
        }
    }

    _configured = false;
    _rxHead = 0U;
    _rxTail = 0U;
    _rxCount = 0U;
    _txHead = 0U;
    _txTail = 0U;
    _txCount = 0U;
    _txDmaCount = 0U;
    _txDmaRunning = false;
    releaseConstlatIfNeeded();
}

bool HardwareSerial::setPins(int8_t rxPin, int8_t txPin) {
    if (_uart == nullptr) {
        return false;
    }

    const uint8_t nextRxPin = (rxPin >= 0) ? static_cast<uint8_t>(rxPin) : _rxPin;
    const uint8_t nextTxPin = (txPin >= 0) ? static_cast<uint8_t>(txPin) : _txPin;

    uint8_t txPort = 0;
    uint8_t tx = 0;
    uint8_t rxPort = 0;
    uint8_t rx = 0;
    if (!decode_pin(nextTxPin, &txPort, &tx) || !decode_pin(nextRxPin, &rxPort, &rx) ||
        !uart_route_valid(_uart, txPort, tx, rxPort, rx)) {
        return false;
    }

    const bool wasConfigured = _configured;
    const unsigned long baud = _baud;
    const uint16_t config = _config;

    if (wasConfigured) {
        end();
    }

    _txPin = nextTxPin;
    _rxPin = nextRxPin;

    if (!wasConfigured) {
        return true;
    }

    begin(baud, config);
    return _configured;
}

bool HardwareSerial::isConfigured() const {
    return _configured && (_uart != nullptr);
}

unsigned long HardwareSerial::baud() const {
    return _baud;
}

void HardwareSerial::forceReInit() {
    if (!_configured || _uart == nullptr || _txPin == 0xFFU || _rxPin == 0xFFU) {
        return;
    }

    const uintptr_t base = reinterpret_cast<uintptr_t>(_uart);

    const uint32_t txDrainStartUs = micros();
    while ((_txCount != 0U || _txDmaRunning) &&
           static_cast<uint32_t>(micros() - txDrainStartUs) < 10000UL) {
        serviceTxDma();
    }

    stopRxDma();
    reg32(base + U_INTENCLR) = kUarteRxInterruptMask | kUarteTxInterruptMask;
    reg32(base + U_TASKS_DMA_TX_STOP) = UARTE_TASKS_DMA_TX_STOP_STOP_Trigger;
    wait_event_timeout_us(base, U_EVENTS_TXSTOPPED, 2000UL);
    reg32(base + U_ENABLE) = UARTE_ENABLE_ENABLE_Disabled;

