lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/HardwareSerial.cpp
size_t HardwareSerial::writeBlocking(const uint8_t* buffer, size_t size, bool waitStopped) {
    if (!_configured || _uart == nullptr) {
        return 0U;
    }
    if (buffer == nullptr || size == 0U) {
        return 0U;
    }
    if (_constlatOwned) {
        NRF_POWER->TASKS_CONSTLAT = POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger;
    }

    const uintptr_t base = reinterpret_cast<uintptr_t>(_uart);

    reg32(base + U_EVENTS_DMA_TX_END) = 0U;
    reg32(base + U_EVENTS_TXSTOPPED) = 0U;
    // Do NOT clear EVENTS_ERROR or ERRORSRC here: those registers are shared
    // with the RX path (ERRORSRC holds only RX error bits on nRF54L15).
    // Clearing them races with a pending RX OVERRUN IRQ and can hide the error
    // from processRxDmaEvents, leaving DMA in an unrecovered state.
    reg32(base + U_DMA_TX_PTR) = static_cast<uint32_t>(reinterpret_cast<uintptr_t>(buffer));
    reg32(base + U_DMA_TX_MAXCNT) = static_cast<uint32_t>(size);

    reg32(base + U_TASKS_DMA_TX_START) = UARTE_TASKS_DMA_TX_START_START_Trigger;
    if (!wait_event_timeout_us(base, U_EVENTS_DMA_TX_END,
                               serial_byte_timeout_us(_baud, static_cast<uint32_t>(size)))) {
        // Recover on timeout to prevent partial-frame stream corruption.
        reg32(base + U_TASKS_DMA_TX_STOP) = UARTE_TASKS_DMA_TX_STOP_STOP_Trigger;
        wait_event_timeout_us(base, U_EVENTS_TXSTOPPED, 2000UL);
        return 0U;
    }

    if (waitStopped) {
        wait_event_timeout_us(base, U_EVENTS_TXSTOPPED, 5000UL);
    }

    return size;
}

bool HardwareSerial::usesBridgePins() const {
    return usesPins(PIN_SAMD11_RX, PIN_SAMD11_TX);
}

void HardwareSerial::handleIrq() {
    if (_uart != nullptr) {
        processTxDmaEvents(reinterpret_cast<uintptr_t>(_uart));
    }
    processRxDmaEvents();
}

bool HardwareSerial::usesP2Pins() const {
    uint8_t txPort = 0U;
    uint8_t tx = 0U;
    uint8_t rxPort = 0U;
    uint8_t rx = 0U;
    if (!decode_pin(_txPin, &txPort, &tx) || !decode_pin(_rxPin, &rxPort, &rx)) {
        return false;
    }
    return (txPort == 2U) || (rxPort == 2U);
}

void HardwareSerial::requestConstlatIfNeeded() {
    if (!usesP2Pins() || _constlatOwned) {
        return;
    }

    _constlatOwned = nrf54l15_constlat_acquire() != 0U;
}

void HardwareSerial::releaseConstlatIfNeeded() {
    if (!_constlatOwned) {
        return;
    }

    nrf54l15_constlat_release();
    _constlatOwned = false;
}

int HardwareSerial::available() {
    serviceRxDma();
    return static_cast<int>(_rxCount);
}

int HardwareSerial::availableForWrite() {
    serviceTxDma();
    const uint32_t primask = __get_PRIMASK();
    __disable_irq();
    const int free = static_cast<int>(kTxRingSize - _txCount);
    __set_PRIMASK(primask);
    return free;
}

int HardwareSerial::read() {
    serviceRxDma();
    const uint32_t primask = __get_PRIMASK();
    __disable_irq();
    if (_rxCount == 0U) {
        __set_PRIMASK(primask);
        return -1;
    }

    const uint8_t value = _rxRing[_rxTail];
    _rxTail = static_cast<uint16_t>(
        (_rxTail + 1U) & static_cast<uint16_t>(kRxRingSize - 1U));
    --_rxCount;
    __set_PRIMASK(primask);
    return static_cast<int>(value & _dataMask);
}

int HardwareSerial::peek() {
    serviceRxDma();
    const uint32_t primask = __get_PRIMASK();
    __disable_irq();
    if (_rxCount == 0U) {
        __set_PRIMASK(primask);
        return -1;
    }
    const int value = static_cast<int>(_rxRing[_rxTail] & _dataMask);
    __set_PRIMASK(primask);
    return value;
}

void HardwareSerial::flush() {
    if (!_configured || _uart == nullptr) {
        return;
    }

    while (true) {
        serviceTxDma();

        const uint32_t primask = __get_PRIMASK();
        __disable_irq();
        const bool idle = (_txCount == 0U) && !_txDmaRunning;
        __set_PRIMASK(primask);
        if (idle) {
            break;
        }

        // yield() removed: preempts UARTE DMA at low bauds
    }
}

size_t HardwareSerial::write(uint8_t value) {
    const uint8_t masked = static_cast<uint8_t>(value & _dataMask);
    return write(&masked, 1U);
}

size_t HardwareSerial::write(const uint8_t* buffer, size_t size) {
    if (!_configured || _uart == nullptr) {
        return 0U;
    }
    if (buffer == nullptr || size == 0U) {
        return 0U;
    }

    // Bridge direct-writes at low baud (<=9600) are disabled: the writeBlocking()
    // path races with the SHORTS DMA_TX_END→DMA_TX_STOP chain on the SAMD11 bridge
    // UART (XIAO nRF54L15), corrupting newline bytes. Let writes flow through the
    // ring-buffer + DMA path, which is reliable at all baud rates.

    // Small low-baud writes on header UARTs (for example GNSS command bursts)
    // are latency-sensitive. Drain them synchronously when the port is idle so
    // sketches do not need an explicit flush() to get the bytes onto the wire.
    if (!usesBridgePins() && _baud <= 9600UL && size <= kLowBaudDirectWriteMax) {
        const uint32_t primask = __get_PRIMASK();
        __disable_irq();
        const bool txIdle = (_txCount == 0U) && !_txDmaRunning;
        __set_PRIMASK(primask);
        if (txIdle) {
            for (size_t i = 0U; i < size; ++i) {
                _txBuffer[i] = static_cast<uint8_t>(buffer[i] & _dataMask);
            }
            return writeBlocking(_txBuffer, size, true);
        }
    }

    const uintptr_t base = reinterpret_cast<uintptr_t>(_uart);
    size_t written = 0U;
    while (written < size) {
        serviceTxDma();

        const uint32_t primask = __get_PRIMASK();
        __disable_irq();
        processTxDmaEvents(base);

        uint16_t free = static_cast<uint16_t>(kTxRingSize - _txCount);
        if (free == 0U) {
            __set_PRIMASK(primask);
            // yield() removed: preempts UARTE DMA at low bauds
            continue;
        }

        size_t chunk = size - written;
        if (chunk > free) {
            chunk = free;
        }

        if (_dataMask == 0xFFU) {
            for (size_t i = 0U; i < chunk; ++i) {
                _txRing[_txHead] = buffer[written + i];
                _txHead = static_cast<uint16_t>(
                    (_txHead + 1U) & static_cast<uint16_t>(kTxRingSize - 1U));
            }
        } else {
            for (size_t i = 0U; i < chunk; ++i) {
                _txRing[_txHead] = static_cast<uint8_t>(buffer[written + i] & _dataMask);
                _txHead = static_cast<uint16_t>(
                    (_txHead + 1U) & static_cast<uint16_t>(kTxRingSize - 1U));
            }
        }
        _txCount = static_cast<uint16_t>(_txCount + chunk);
        written += chunk;

