lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/HardwareSerial.cpp
        startNextTxDmaLocked(base);
        __set_PRIMASK(primask);

        // yield() removed: preempts UARTE DMA at low bauds
    }

    return written;
}

HardwareSerial::operator bool() const {
    return _configured && (_uart != nullptr);
}


bool HardwareSerial::usesPins(uint8_t txPin, uint8_t rxPin) const {
    return (_txPin == txPin) && (_rxPin == rxPin);
}

bool HardwareSerial::quiesceForSystemOff(uint32_t spinLimit) {
    if (!_configured || _uart == nullptr) {
        return true;
    }

    uint32_t remaining = spinLimit;
    while ((_txCount != 0U || _txDmaRunning) && remaining > 0U) {
        serviceTxDma();
        --remaining;
    }
    if (_txCount != 0U || _txDmaRunning) {
        return false;
    }

    end();
    return !_configured && _lastShutdownClean;
}

extern "C" void nrf54l15_serial_prepare_idle_sleep(void) {
    if (g_sharedConstlatUsers != 0U) {
        NRF_POWER->TASKS_CONSTLAT = POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger;
    }
}

extern "C" uint8_t nrf54l15_constlat_users_active(void) {
    return (g_sharedConstlatUsers != 0U) ? 1U : 0U;
}

static constexpr uint8_t kSerialPinDisconnected = 0xFFU;

#if defined(NRF54L15_CLEAN_SERIAL_DISABLED)
HardwareSerial Serial(NRF_UARTE21, kSerialPinDisconnected, kSerialPinDisconnected);
HardwareSerial Serial1(NRF_UARTE20, kSerialPinDisconnected, kSerialPinDisconnected);
#elif defined(ARDUINO_NRF54L15DK_PCA10156)
#if defined(NRF54L15_CLEAN_SERIAL_ROUTE_HEADER)
HardwareSerial Serial(NRF_UARTE20, PIN_SERIAL_TX, PIN_SERIAL_RX);
#else
HardwareSerial Serial(NRF_UARTE30, PIN_SAMD11_RX, PIN_SAMD11_TX);
#endif
HardwareSerial Serial1(NRF_UARTE21, PIN_SERIAL1_TX, PIN_SERIAL1_RX);
#elif defined(NRF54L15_CLEAN_SERIAL_ROUTE_HEADER)
#if defined(NRF54L15_CLEAN_SERIAL_ROUTE_HEADER_SWAP_INSTANCES)
HardwareSerial Serial(NRF_UARTE20, PIN_SERIAL_TX, PIN_SERIAL_RX);
HardwareSerial Serial1(NRF_UARTE21, PIN_SAMD11_RX, PIN_SAMD11_TX);
#else
HardwareSerial Serial(NRF_UARTE21, PIN_SERIAL_TX, PIN_SERIAL_RX);
HardwareSerial Serial1(NRF_UARTE20, PIN_SAMD11_RX, PIN_SAMD11_TX);
#endif
#else
HardwareSerial Serial(NRF_UARTE20, PIN_SAMD11_RX, PIN_SAMD11_TX);
HardwareSerial Serial1(NRF_UARTE21, PIN_SERIAL1_TX, PIN_SERIAL1_RX);
#endif

// Compatibility alias for sketches/libraries that expect Serial2.
HardwareSerial& Serial2 = Serial1;

extern "C" uint8_t nrf54l15_bridge_serial_active(void) {
    const bool serialBridgeActive =
        Serial.isConfigured() && Serial.usesPins(PIN_SAMD11_RX, PIN_SAMD11_TX);
    const bool serial1BridgeActive =
        Serial1.isConfigured() && Serial1.usesPins(PIN_SAMD11_RX, PIN_SAMD11_TX);
    return (serialBridgeActive || serial1BridgeActive) ? 1U : 0U;
}

extern "C" void nrf54l15_serial_idle_service(void) {
    Serial.serviceTxDma();
    Serial1.serviceTxDma();
}

extern "C" bool nrf54_core_quiesce_serial_for_system_off(uint32_t spin_limit) {
    const bool serialOk = Serial.quiesceForSystemOff(spin_limit);
    const bool serial1Ok = Serial1.quiesceForSystemOff(spin_limit);
    return serialOk && serial1Ok;
}
